2026A/calidad-software/talleres/tercer-corte/spg-v2/proyecto_integrador_v2/sgp-backend/src/test/jmeter/report-carga/statistics.json
{
  "02 - GET /equipos" : {
    "transaction" : "02 - GET /equipos",
    "sampleCount" : 673,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.47845468053495,
    "medianResTime" : 13.0,
    "minResTime" : 3.0,
    "maxResTime" : 1201.0,
    "pct1ResTime" : 54.200000000000045,
    "pct2ResTime" : 145.0,
    "pct3ResTime" : 790.039999999999,
    "throughput" : 13.061874078099526,
    "receivedKBytesPerSec" : 13.750683843936805,
    "sentKBytesPerSec" : 5.9827815374873845
  },
  "03 - GET /prestamos" : {
    "transaction" : "03 - GET /prestamos",
    "sampleCount" : 656,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 54.03658536585364,
    "medianResTime" : 19.0,
    "minResTime" : 4.0,
    "maxResTime" : 1276.0,
    "pct1ResTime" : 70.30000000000007,
    "pct2ResTime" : 158.7499999999999,
    "pct3ResTime" : 1049.999999999995,
    "throughput" : 12.930949518046166,
    "receivedKBytesPerSec" : 9.496166052315152,
    "sentKBytesPerSec" : 5.947962660897676
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2020,
    "errorCount" : 9,
    "errorPct" : 0.44554454,
    "meanResTime" : 61.107425742574364,
    "medianResTime" : 15.0,
    "minResTime" : 3.0,
    "maxResTime" : 5065.0,
    "pct1ResTime" : 63.90000000000009,
    "pct2ResTime" : 185.89999999999964,
    "pct3ResTime" : 1003.2199999999993,
    "throughput" : 35.03659763416242,
    "receivedKBytesPerSec" : 30.2009922609446,
    "sentKBytesPerSec" : 13.623583820073195
  },
  "01 - POST /auth/login" : {
    "transaction" : "01 - POST /auth/login",
    "sampleCount" : 691,
    "errorCount" : 9,
    "errorPct" : 1.3024602,
    "meanResTime" : 87.91172214182349,
    "medianResTime" : 15.0,
    "minResTime" : 3.0,
    "maxResTime" : 5065.0,
    "pct1ResTime" : 60.00000000000034,
    "pct2ResTime" : 290.7999999999996,
    "pct3ResTime" : 2585.5200000000223,
    "throughput" : 11.988202637057599,
    "receivedKBytesPerSec" : 9.55877469530708,
    "sentKBytesPerSec" : 3.043913460704372
  }
}