2026A/calidad-software/talleres/tercer-corte/spg-v2/proyecto_integrador_v2/sgp-backend/src/test/jmeter/report-estres/statistics.json
{
  "02 - GET /equipos" : {
    "transaction" : "02 - GET /equipos",
    "sampleCount" : 4208,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.93749999999987,
    "medianResTime" : 15.0,
    "minResTime" : 1.0,
    "maxResTime" : 4443.0,
    "pct1ResTime" : 93.09999999999991,
    "pct2ResTime" : 239.54999999999973,
    "pct3ResTime" : 932.6399999999994,
    "throughput" : 36.15089217446585,
    "receivedKBytesPerSec" : 38.0572868789787,
    "sentKBytesPerSec" : 16.557290369068994
  },
  "03 - GET /prestamos" : {
    "transaction" : "03 - GET /prestamos",
    "sampleCount" : 4202,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 66.71061399333671,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 7415.0,
    "pct1ResTime" : 119.0,
    "pct2ResTime" : 268.0,
    "pct3ResTime" : 896.640000000003,
    "throughput" : 36.04237251790539,
    "receivedKBytesPerSec" : 26.468617317836774,
    "sentKBytesPerSec" : 16.57808345306
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 12622,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 73.65441292980512,
    "medianResTime" : 19.0,
    "minResTime" : 1.0,
    "maxResTime" : 7415.0,
    "pct1ResTime" : 122.0,
    "pct2ResTime" : 294.0,
    "pct3ResTime" : 1135.5400000000009,
    "throughput" : 105.95148157475028,
    "receivedKBytesPerSec" : 91.28065683234702,
    "sentKBytesPerSec" : 41.37908364286913
  },
  "01 - POST /auth/login" : {
    "transaction" : "01 - POST /auth/login",
    "sampleCount" : 4212,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 94.28561253561256,
    "medianResTime" : 18.0,
    "minResTime" : 1.0,
    "maxResTime" : 4937.0,
    "pct1ResTime" : 156.0,
    "pct2ResTime" : 584.0999999999995,
    "pct3ResTime" : 1251.7399999999998,
    "throughput" : 35.4134086667003,
    "receivedKBytesPerSec" : 28.237524159120717,
    "sentKBytesPerSec" : 8.991652951537775
  }
}